---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceY
source: html/dc6b4ea7-8ad2-fe4f-4dbc-9d5062ffa837.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceY Property

"Edge distance on side 2"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternEdgeDistanceY { get; }
```